{
  "date": "2025-10-11",
  "title": "Rewrite Your Defaults: Stop Hitting “Remind Me Later” on God’s Update",
  "category": "Weekend 4-3-2-1",
  "excerpt": "Busy isn’t a badge—it’s a yoke. This weekend, stop postponing God’s updates and let Him rewire your defaults for peace, purpose, and power.",
  "reading_minutes": 8,
  "author": "TheWrkShop Team",
  "body_html": [
    "<section class=\"section\">",
    "  <div class=\"kicker\">TheWrkShop Happy 4-3-2-1 Weekend Edition</div>",
    "  <h1 class=\"h1\">Rewrite Your Defaults</h1>",
    "  <h3 class=\"sub\">Stop Hitting “Remind Me Later” on God’s Update</h3>",
    "  <p>Dear WorkShopper,</p>",
    "  <p>When life gets busy, it’s easy to drift—not into obvious sin, but away from God. We slip from prayer, Scripture, and worship, not because we hate God but because we run on autopilot.</p>",
    "  <p>Here’s the deception: busyness is its own yoke. As Adam Jones put it, “Busy is being under Satan’s yoke.” It feels productive and even noble, but it isolates us from the God who gives rest, wisdom, strength, and peace. When we don’t “update” our hearts with His Word, our old defaults take over: pride, fear, short fuses, and self-reliance.</p>",
    "  <p>Think about your phone—how often do you hit “remind me later” on a system update? That update is designed to protect you and make everything run better. God’s updates do even more. They come through surrender, submission, prayer, Scripture, and worship. The question is: will we install them, or keep hitting “later”?</p>",
    "  <div class=\"tip\"><p><strong>One-Minute Win of the Week</strong><br>Before your next text, task, or meeting, take 60 seconds to whisper a prayer. Expect God’s presence, not entitlement (see Matthew 9:20–22).</p></div>",
    "</section>",
    "<div class=\"rule\"></div>",
    "<section class=\"section\">",
    "  <h2 class=\"h2\">Picture This</h2>",
    "  <p>Two men stand at a crossroads. One grabs a microwave meal—quick, easy, empty. The other waits for a slow-cooked feast—rich, nourishing, deeply satisfying. Which do you want for your soul?</p>",
    "</section>",
    "<section class=\"section\">",
    "  <h2 class=\"h2\">4 Scriptures · Insights · Gems</h2>",
    "  <div class=\"kv\">",
    "    <div>",
    "      <div class=\"k\">Matthew 6:33</div>",
    "      <p class=\"quote\">“Seek first the kingdom of God and His righteousness, and all these things will be added to you.”</p>",
    "      <p class=\"sub\">Insight: When God isn’t first, everything else feels out of order.</p>",
    "      <p><em>Gem:</em> Seek God first, and watch everything else fall into place.</p>",
    "    </div>",
    "    <div>",
    "      <div class=\"k\">Romans 12:2</div>",
    "      <p class=\"quote\">“Do not be conformed to this world, but be transformed by the renewal of your mind…”</p>",
    "      <p class=\"sub\">Insight: The world pushes busyness and burnout; renewal resists and rewires.</p>",
    "      <p><em>Gem:</em> Renewal is the reset button you’ve been looking for.</p>",
    "    </div>",
    "    <div>",
    "      <div class=\"k\">2 Corinthians 10:5</div>",
    "      <p class=\"quote\">“…take every thought captive to obey Christ.”</p>",
    "      <p class=\"sub\">Insight: Your thoughts are either captives or captors.</p>",
    "      <p><em>Gem:</em> Don’t let runaway thoughts run your life—chain them to Christ.</p>",
    "    </div>",
    "    <div>",
    "      <div class=\"k\">John 15:5</div>",
    "      <p class=\"quote\">“I am the vine; you are the branches…apart from me you can do nothing.”</p>",
    "      <p class=\"sub\">Insight: Busyness fakes productivity; abiding bears lasting fruit.</p>",
    "      <p><em>Gem:</em> Abide in Christ and fruit will follow; abide in self and frustration will follow.</p>",
    "    </div>",
    "  </div>",
    "</section>",
    "<section class=\"section\">",
    "  <h2 class=\"h2\">3 Insights to Chew On</h2>",
    "  <ol class=\"list\">",
    "    <li><strong>Isolation isn’t rest</strong>—it’s starvation. Pulling back feels easier but drains your spirit.</li>",
    "    <li><strong>Defaults reveal discipline.</strong> What you do under pressure mirrors what you’ve practiced in private.</li>",
    "    <li><strong>God works like a slow cooker.</strong> Slower, but it produces lasting nourishment.</li>",
    "  </ol>",
    "</section>",
    "<section class=\"section\">",
    "  <h2 class=\"h2\">2 Questions to Ask Yourself</h2>",
    "  <ol class=\"list\">",
    "    <li>What “default setting” do I run to when life gets chaotic—self-reliance or God’s presence?</li>",
    "    <li>What practical “update” can I install this week—Scripture, prayer, or a worship rhythm?</li>",
    "  </ol>",
    "</section>",
    "<section class=\"section\">",
    "  <h2 class=\"h2\">1 Action Step</h2>",
    "  <p><strong>Replace a Default:</strong> Pick one knee-jerk reaction (anger, avoidance, distraction) and replace it with a God-response (prayer, Scripture, worship). Invite a brother to walk with you.</p>",
    "</section>",
    "<div class=\"rule\"></div>",
    "<section class=\"section\">",
    "  <h2 class=\"h2\">How Rewiring Happens (Bonus)</h2>",
    "  <p>This is spiritual and neurological practice—simple and repeatable.</p>",
    "  <ol class=\"list\">",
    "    <li>Identify the Lie</li>",
    "    <li>Find the Truth (Scripture)</li>",
    "    <li>Repeat It Daily</li>",
    "    <li>Act Accordingly</li>",
    "    <li>Reinforce It in Community</li>",
    "  </ol>",
    "  <p><em>Gem:</em> You’re not stuck—you’re rehearsing the wrong script. God is giving you a new one.</p>",
    "</section>",
    "<section class=\"section callout\">",
    "  <p><strong>Prayer</strong><br>Father, stop me from postponing Your work in me. Renew my mind where it’s been wired by fear or failure. Teach me to wait well, dwell deep, and trust fully. In Jesus’ name, amen.</p>",
    "  <p><strong>Declaration</strong><br>I walk in step with the Spirit. My mind is renewed. My roots are deep. I won’t delay Your updates in me.</p>",
    "</section>",
    "<section class=\"section\">",
    "  <h2 class=\"h2\">Weekly Challenge + Invitation</h2>",
    "  <p><strong>Challenge:</strong> Replace 30 minutes of scrolling with 30 minutes of Scripture and stillness. Don’t rush it. Dwell in it.</p>",
    "  <p><strong>Invitation:</strong> If this hit you where you are, share it with a friend. Let’s build men of faith—together.</p>",
    "  <p>Here for you,<br>TheWrkShop Team</p>",
    "  <p class=\"sub\">P.S. Know a man who needs this reset? Send his email to <a href=\"mailto:steven@thewrkshop.com\">steven@thewrkshop.com</a>.</p>",
    "</section>"
  ]
}
